[
  {
    "id": 1,
    "name": "Morning rally",
    "text": "As the sun rises over the serene campus of NIT Silchar, a palpable excitement fills the air, signalling the dawn of a new day and beginning of a grand celebration.Thousands of students, faculty members, and residents of NIT Silchar gather, their faces adorned with smiles of anticipation and unity. The morning rally of NIT Silchar's Oikyotaan paints a vibrant picture against the backdrop of the verdant campus. Each participant carries symbols of unity and harmony, embodying the spirit of togetherness that defines this annual event. Colourful bannerflutter in the gentle breeze, bearing messages of solidarity and camaraderie.",
    "src": "https://res.cloudinary.com/dgnlmdkyq/image/upload/v1712836127/Oikyotaan/Gallery/Screenshot_2024-04-11_171218_tidavq.webp"  
  },
  {
    "id": 2,
    "name": "Shokaler Adda",
    "text": "From the captivating aroma of a bustling café to the tranquil elegance of a traditional tea ceremony, Bengalis reign supreme in the realm of savoring delightful conversations over steaming cups of tea. And, there exists no such topic into which a Bengali person does indulge. From politics to food and culture, a lively discussion over a cup of tea always awaits. So, on this Bengali New Year's Eve, the Oikyotaan family is organizing a gathering, just like in the previous years. We will spend a glorious morning while indulging in dancing, singing, reciting, and telling stories.",
    "src": "https://res.cloudinary.com/dgnlmdkyq/image/upload/v1712836130/Oikyotaan/Gallery/Screenshot_2024-04-11_171302_ppn7lo.webp"
  },
  {
    "id": 3,
    "name": "Student and Faculty Performance",
    "text": "As spring bids farewell, witness the blooming of countless new flowers and the emergence of fresh leaves on every tree. The gentle spring breeze feels like a soothing swing through our hearts, bringing a sense of renewal and joy. We say goodbye to the old and welcome the new year with Oikyotaan 2024. And on the auspicious occasion of Pohela Boishakh, the dawn of the Bengali New Year, it is not merely the students who revel in its splendor, but our esteeme faculty members, too, join in the festivities with great zeal and camaraderie. The festivities commence with the break of dawn, where professors and students alike engage in rhythmic clapping and merriment.",
    "src": "https://res.cloudinary.com/dgnlmdkyq/image/upload/v1712856167/Oikyotaan/Gallery/Screenshot_2024-04-11_225223_kwkjwj.webp"
  },
  {
    "id": 4,
    "name": "Donation Drive ",
    "text": "In an effort to bridge the gap between abundance and need within our student  community, we are thrilled to announce a donation drive as part of our commitment to support and uplift each other. This initiative is designed to collect gently used educational material clothing, and electronics from students who are willing to donate, and redistribute them to fellow students facing financial hardships.",
    "src": "https://res.cloudinary.com/dgnlmdkyq/image/upload/v1712856467/Oikyotaan/Gallery/Screenshot_2024-04-11_225511_caq64q.webp"
  },
  {
    "id": 5,
    "name": "Street Painting",
    "text": "In the heart of OIKYOTAAN where vibrant sarees dance in the wind and the rhythmic beats of dhaak echo through the streets of NIT Silchar, there's another art form weaving its magic – street painting. It's not just about splashes of colour adorning walls; it's a vibrant expression that resonates deeply with the Bengali spirit. This artistic tapestry isn't confined to galleries; it spills onto public spaces,becoming a shared experience that unites communities and ignites a sense of belonging",
    "src": "https://res.cloudinary.com/dgnlmdkyq/image/upload/v1712856572/Oikyotaan/Gallery/Screenshot_2024-04-11_225712_z037hq.webp"
  },
  {
    "id": 6,
    "name": "Magazine Inauguration",
    "text": "Language is not just a collection of words, but a living expression of our culture. Hidden in each word, each twist and turn, are the stories of our history, the lives of our ancestors, their beliefs, and their values. However, the customs, traditions, food, and festivals of our beloved Bengal - all come together to create a unique blend, one that represents our culture. And, to understand this exciting culture, we are proud to organise our annual magazine Barnamala, which is filled with a collection of poems, short stories and essays. ",
    "src": "https://res.cloudinary.com/dgnlmdkyq/image/upload/v1712836175/Oikyotaan/Gallery/Screenshot_2024-04-11_171653_wtnfah.webp"
  },
  {
    "id": 7,
    "name": "Ramp Walk",
    "text": "Cultural ramp walks are not just fashion shows, they are cultural symphonies, orchestrating a harmonious blend oftradition, innovation and global solidarity. With each stride, a tapestry of tradition and innovation is woven, bridging the gap between the past and the present while enduring the legacy of Bengali culture.From the vibrant colours of Jamdani sarees to the melodious rhythms of Rabindra Sangeet, with each step on the runway, we shall get to witness the beauty of Bengali tradition! So, don't miss a chance to be a part of this wonderful event, so called as the Ramp Walk and delve into a world of fashion and tradition.",
    "src": "https://res.cloudinary.com/dgnlmdkyq/image/upload/v1712856772/Oikyotaan/Gallery/Screenshot_2024-04-11_230158_qtd0ob.webp"
  }
]
